In [1]:
import numpy as np
import pandas as pd

In [78]:
df1 = pd.DataFrame(
    {
        "Year": [1776, 328,1821],
        "Pop": [328, 38,126]
    },
    index=['USA','Canada','Mexico'],
)

df2 = pd.DataFrame(
    {
        "Gdp": [20.5, 1.7,1.22],
        "Pecentage": [75, 0,25]
    },
    index=['USA','Canada','Mexico'],
)

In [77]:
df1

        Year  Pop
USA     1776  328
Canada   328   38
Mexico  1821  126

In [79]:
df2

          Gdp  Pecentage
USA     20.50         75
Canada   1.70          0
Mexico   1.22         25

In [82]:
df = pd.concat([df1,df2],axis=1)

In [83]:
df

        Year  Pop    Gdp  Pecentage
USA     1776  328  20.50         75
Canada   328   38   1.70          0
Mexico  1821  126   1.22         25

In [84]:
df3 = pd.DataFrame(
    {
        "Year": [1947, 1900,2000],
        "Pop": [20.5, 1.7,1.22],
        "Gdp": [20.5, 1.7,1.22],
        "Pecentage": [75, 0,25]
    },
    index=['India','Japan','Chine'],
)

In [85]:
df3

       Year    Pop    Gdp  Pecentage
India  1947  20.50  20.50         75
Japan  1900   1.70   1.70          0
Chine  2000   1.22   1.22         25

In [88]:
df = pd.concat([df,df3])

In [89]:
df

        Year     Pop    Gdp  Pecentage
USA     1776  328.00  20.50         75
Canada   328   38.00   1.70          0
Mexico  1821  126.00   1.22         25
India   1947   20.50  20.50         75
Japan   1900    1.70   1.70          0
Chine   2000    1.22   1.22         25

In [98]:
registration = pd.DataFrame({
    "regid" : [1,2,3,4],
    "name"  : ['Andrew','Bob','Charlie','david']
})
logins = pd.DataFrame({
    "log_id" : [1,2,3,4],
    "name"  : ['Xavier','Andrew','Yolanda','Bob']
})

In [107]:
registration

   regid     name
0      1   Andrew
1      2      Bob
2      3  Charlie
3      4    david

In [99]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

In [105]:
pd.merge(registration,logins,"inner",'name')

   regid    name  log_id
0      1  Andrew       2
1      2     Bob       4

In [106]:
pd.merge(registration,logins,"left",'name')

   regid     name  log_id
0      1   Andrew     2.0
1      2      Bob     4.0
2      3  Charlie     NaN
3      4    david     NaN

In [108]:
pd.merge(registration,logins,"right",'name')

   regid     name  log_id
0    NaN   Xavier       1
1    1.0   Andrew       2
2    NaN  Yolanda       3
3    2.0      Bob       4

In [109]:
pd.merge(registration,logins,"outer",'name')

   regid     name  log_id
0    1.0   Andrew     2.0
1    2.0      Bob     4.0
2    3.0  Charlie     NaN
3    4.0    david     NaN
4    NaN   Xavier     1.0
5    NaN  Yolanda     3.0